Autodesk.Revit.DB.UnitUtils.GetTypeCatalogStringForUnit(Autodesk.Revit.DB.ForgeTypeId)
Gets the string used in type catalogs to identify a given unit.
unitTypeId:
Identifier of the unit.
Returns:
The type catalog string, or an empty string if the unit cannot be used in type catalogs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetTypeCatalogStringForSpec(Autodesk.Revit.DB.ForgeTypeId)
Gets the string used in type catalogs to identify a given measurable spec.
specTypeId:
Identifier of the measurable spec.
Returns:
The type catalog string, or an empty string if the measurable spec cannot be used in type catalogs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetAllDisciplines
Gets the identifiers of all available disciplines.
Returns:
The discipline identifiers.
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetDiscipline(Autodesk.Revit.DB.ForgeTypeId)
Gets the discipline for a given measurable spec.
specTypeId:
Identifier of the measurable spec.
Returns:
Identifier of the discipline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsSymbol(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a symbol.
Remarks:
The SymbolTypeId class offers symbol identifiers.
symbolTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a symbol, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsUnit(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a unit.
Remarks:
The UnitTypeId class offers unit identifiers.
unitTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a unit, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetValidUnits(Autodesk.Revit.DB.ForgeTypeId)
Gets the identifiers of all valid units for a given measurable spec.
specTypeId:
Identifier of the measurable spec.
Returns:
Identifiers of the valid units.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsValidUnit(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
Checks whether a unit is valid for a given measurable spec.
specTypeId:
Identifier of the measurable spec.
unitTypeId:
Identifier of the unit to check.
Returns:
True if the unit is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetAllUnits
Gets the identifiers of all available units.
Returns:
The unit identifiers.
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetAllMeasurableSpecs
Gets the identifiers of all available measurable specs.
Returns:
The spec identifiers.
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsMeasurableSpec(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a spec associated with units of measurement.
specTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a measurable spec, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.ConvertToInternalUnits(System.Double,Autodesk.Revit.DB.ForgeTypeId)
Converts a value from a given unit to Revit's internal units.
value:
The value to convert.
unitTypeId:
Identifier of the unit quantifying the value.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.ConvertFromInternalUnits(System.Double,Autodesk.Revit.DB.ForgeTypeId)
Converts a value from Revit's internal units to a given unit.
value:
The value to convert.
unitTypeId:
Identifier of the desired unit.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.Convert(System.Double,Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
Converts a value from one unit to another, such as square feet to square meters.
value:
The value to convert.
currentUnitTypeId:
Identifier of the current unit.
desiredUnitTypeId:
Identifier of the desired unit.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
currentUnitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
-or-
desiredUnitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
currentUnitTypeId and desiredUnitTypeId have different dimensions.
Since:
2014